# Import libraries

In [4]:
import pandas as pd
import numpy as np
import os

# Create path

In [7]:
path = r'C:\Users\shaiv\Downloads\Instacart Basket Analysis'
path

'C:\\Users\\shaiv\\Downloads\\Instacart Basket Analysis'

# Import data

In [10]:
# import orders_product_prior data set
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_prior.csv'), index_col = False)

In [11]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [12]:
# check the size
df_ords_prior.shape

(32434489, 4)

In [13]:
# import orders_checked data set
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'), index_col = False)

In [14]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False

In [15]:
# Removing column "Unnamed: 0" from the df_ords dataframe and assigning a new dataframe
df_ords_clean = df_ords.drop('Unnamed: 0', axis = 1)

In [16]:
df_ords_clean.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

In [17]:
# check the size
df_ords_clean.shape

(3421083, 7)

### 01 Merge orders_products_prior dataframe

In [18]:
# inner merge dataframe 

df_merge_large = df_ords_clean.merge(df_ords_prior, on = ['order_id'] , how = 'inner', indicator = True)

In [32]:
df_merge_large.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [34]:
df_merge_large.shape

(32434489, 11)

##### In the code provided, the intended merge operation is an inner join. This type of merge retains only the rows that have matching order_id values in both dataframes. The results of the merge will show how many rows came from both dataframes, and the _merge column indicates the origin of each rows appeared in both df_ords_clean and df_ords_prior (matched on order_id). If all rows are 'both', that means every row had a matching entry in both dataframes. Looking at shape before and after merge the no of rows are same so nothing is missing in the data.

In [19]:
# examine value counts on '_merge' column

df_merge_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

### 02 Exporting merged file in pickle format as “orders_products_combined.pkl”

In [20]:
# export data as pickle
df_merge_large.to_pickle(os.path.join(path, '02 data' , 'prepared data' , 'orders_products_combined.pkl'))